
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository_ruleset.pr_ruleset["terraform-github"] has been deleted
  - resource "github_repository_ruleset" "pr_ruleset" {
      - enforcement = "active" -> null
      - etag        = "W/\"cee29c04dbe4dcc1db071384a951544104dfc785e10b3c28d9b02aaa9600f205\"" -> null
      - id          = "1249622" -> null
      - name        = "require-pull-requests" -> null
      - node_id     = "RRS_lACqUmVwb3NpdG9yec4xqk5BzgATEVY" -> null
      - repository  = "terraform-github" -> null
      - ruleset_id  = 1249622 -> null
      - target      = "branch" -> null

      - conditions {
          - ref_name {
              - exclude = [] -> null
              - include = [
                  - "~ALL",
                ] -> null
            }
        }

      - rules {
          - creation                      = true -> null
          - deletion                      = true -> null
          - non_fast_forward              = false -> null
          - required_linear_history       = true -> null
          - required_signatures           = true -> null
          - update                        = true -> null
          - update_allows_fetch_and_merge = false -> null

          - pull_request {
              - dismiss_stale_reviews_on_push     = false -> null
              - require_code_owner_review         = false -> null
              - require_last_push_approval        = false -> null
              - required_approving_review_count   = 1 -> null
              - required_review_thread_resolution = false -> null
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_ruleset.pr_ruleset["gh-org-template/template-1-terraform"] will be created
  + resource "github_repository_ruleset" "pr_ruleset" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch"
      + node_id     = (known after apply)
      + repository  = "gh-org-template/template-1-terraform"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "main",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

  # github_repository_ruleset.pr_ruleset["gh-org-template/template-template"] will be created
  + resource "github_repository_ruleset" "pr_ruleset" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch"
      + node_id     = (known after apply)
      + repository  = "gh-org-template/template-template"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "main",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

  # github_repository_ruleset.pr_ruleset["gh-org-template/terraform-github"] will be created
  + resource "github_repository_ruleset" "pr_ruleset" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch"
      + node_id     = (known after apply)
      + repository  = "gh-org-template/terraform-github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "main",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->